/*
############################################ ЗАДАНИЕ ###########################################
				Бинарное дерево
	Добавить в класс "Бинарное дерево" следующие
методы:
	* сохранение данных дерева в файл
void SaveDataOnExit(Elem * Node, FILE*f);
	* загрузка данных из файла
void LoadElemFromFile(Elem * Node, FILE*f);
	* балансировка бинарного дерева
void Вalancing();
################################################################################################
2.47.40
*/

#include <iostream>

int main()
{

}